Repository: siefca/timeout
Catalog: po/*.po
Languages: pl

source: timeout: you have to specify timeout value and a command to execute!
pl: timeout: musisz podaæ warto¶æ czasu i komendê do wykonania!

source: timeout: command to invoke is: %s timeout: timeout is set to %d seconds timeout: exit code after timeout is set to %d timeout: signal is set to %d (%s)
pl: timeout: wykonam komendê: %s timeout: czas oczekiwania ustawiony na %d sekund timeout: kod wyj¶cia po czasie oczekiwania to %d timeout: sygna³ wysy³any do niezakoñczonego procesu: %d (%s)

source: timeout: KILL signal will be delivered %d seconds after timeout. timeout: return code after KILL is set to %d
pl: timeout: sygna³ KILL bêdzie dostarczony %d sekund po wcze¶niejszym sygnale. timeout: kod powrotu po KILL ustawiony na %d

source: timeout: return code of successfuly finished proccess will be always 0
pl: timeout: kod powrotu pomy¶lnie zakoñczonego procesu bêdzie zawsze 0

source: Usage: %s [options] timeout command -b time tells timeout to sleep the given number of seconds just before exit -c code sets exit code after KILL signal (only in combination with -k) -e tells timeout to wait for any of -D -E -F commands before exit -i tells timeout to not handle Hangup signal (to avoid timer refresh) -k time sends the KILL signal after the given number of seconds after timeout -m returns always 0 if process had exited before timeout -r code sets return code after timeout -s signal sets name or number of signal to send on timeout -v enables verbose mode -x enables signal code returning instead of exit code -z disables sending signals to all processes in a group -A msg this message will be displayed when timeout arrive -B msg this message will be displayed when (if) KILL arrive -C msg this message will be displayed if process has exited before timeout -D -E -F is the same as -A -B -C but invokes a COMMAND Additional options: -V prints version and exits -l lists available signal names and exits -h this help message
pl: U¿ycie: %s [opcje] czas komenda -b czas ka¿e programowi timeout usn±æ podan± ilo¶æ sekund przed wyj¶ciem -c kod ustawia kod wyj¶cia po wys³aniu KILL (w po³±czeniu z -k) -e czeka na zakoñczenie komend -D -E -F przed wyj¶ciem -i nie obs³uguje sygna³u zawieszenia (zapobiega od¶wie¿aniu zegara) -k czas wysy³a sygna³ KILL po podanej liczbie sekund od ostatniego odliczania -m zwraca zawsze 0 je¶li proces zakoñczy³ siê przed czasem oczekiwania -r kod ustawia kod wyj¶cia po up³yniêciu czasu oczekiwania -s sygna³ ustawia nazwê lub numer sygna³u dostarczanego po podanym czasie -v w³±cza krzykliwy tryb -x w³±cza zwracanie kodu sygna³u zamiast zwracania kodu wyj¶cia potomka -z wy³±cza wysy³anie sygna³ów do wszystkich procesów w grupie potomka -A txt wiadomo¶æ ta bêdzie pokazana gdy up³ynie czas oczekiwania -B txt wiadomo¶æ ta bêdzie pokazana gdy (je¶li) nadejdzie KILL -C txt wiadomo¶æ ta bêdzie pokazana je¶li proces zakoñczy³ siê samodzielnie -D -E -F robi to samo co -A -B -C ale wykonuje podan± KOMENDÊ Opcje dodatkowe: -V drukuje wersjê i wychodzi -l wy¶wietla dostêpne nazwy sygna³ów i wychodzi -h ta wiadomo¶æ

source: timeout: something is wrong.. null pointer at code_name argument!
pl: timeout: co¶ jest nie tak.. zerowy wska¼nik przy argumencie code_name!

source: timeout: invaild return code (digit expected).
pl: timeout: b³êdna warto¶æ kodu powrotu (oczekiwana liczba).

source: timeout: invaild return code value (try 0 to 255).
pl: timeout: b³êdna warto¶æ kodu powrotu (spróbuj 0 to 255).

source: timeout: something is wrong.. null pointer at time_valuee argument!
pl: timeout: co¶ jest nie tak.. zerowy wska¼nik w argumencie time_value!

source: timeout: invaild time value - only digits are supported.
pl: timeout: niew³a¶ciwa warto¶æ czasu - podawaj tylko liczby.

source: timeout: invaild time value - (try 0 to 65536)
pl: timeout: niew³a¶ciwa warto¶æ czasu - (spróbuj 0 do 65536)

source: timeout: killing process %s [%d]
pl: timeout: zabijam proces %s [%d]

source: timeout: timeout for process %s [%d] timeout: sending signal: %s (%d).
pl: timeout: koniec czekania na proces %s [%d] timeout: wysy³am sygna³: %s (%d).

source: timeout: execution of child process finished before %s
pl: timeout: wykonywanie procesu potomnego zakoñczone przed %s

source: kill.
pl: jego zabiciem.

source: timeout.
pl: czasem.

source: timeout: refresh requested...
pl: za¿±dano od¶wie¿enia...

source: reset to %d seconds
pl: ustawiam na %d sekund

source: but cannot be preproccessed (killing state)
pl: lecz nie mo¿e byæ przetworzone (stan ubijania)

source: timeout: something is wrong.. null pointer at signal_name argument!
pl: timeout: co¶ jest nie tak.. zerowy wska¼nik przy argumencie signal_name!

source: timeout: invaild signal specifier (SIGNAME or value requested)
pl: timeout: niew³a¶ciwy specyfikator sygna³u (¿±dana SYGNAZWA lub warto¶æ)

source: timeout: invaild signal name, type -l to get list.
pl: timeout: niew³a¶ciwa nazwa sygna³u, zastosuj -l by otrzymaæ listê.

source: timeout: invaild signal specifier (digit expected).
pl: timeout: niew³a¶ciwy specyfikator sygna³u (oczekiwano liczby).

source: timeout: waiting for additional processes to finish...
pl: timeout: oczekujê na zakoñczenie dodatkowych procesów...

source: timeout: [%d] - finished
pl: timeout: [%d] - zakoñczony

source: timeout: exiting...
pl: timeout: wychodzê...

source: timeout: calling command: %s
pl: timeout: wo³am komendê: %s

source: usage: ping [ -i delay ] [ -c count ] [ -t timeout] host
pl: u¿ycie: ping [ -i opó¼nienie ] [ -c ilo¶æ ] [ -t bezczynno¶æ ] host

source: -- %s ping statistics --
pl: -- %s statystyki ping --

source: %d packet(s) transmitted, %d packet(s) received, %d%% packets lost.
pl: na %d transmitowanych pakietów, %d odebrano, %d%% stracono.

source: round-trip statistics min/avg/max:
pl: statystyki wêdrówki min/¶r./max:

source: (%d/%d/%d usecs)
pl: (%d/%d/%d mikrosekund)

source: (not available due to 100%% packets lost).
pl: (niedostêpny z powodu 100%% utraty pakietów).

source: ping: invalid number of pings.
pl: ping: niew³a¶ciwa liczba pingów.

source: ping: invalid ping delay.
pl: ping: niew³a¶ciwe opó¼nienie.

source: ping: invalid ping timeout.
pl: ping: niew³a¶ciwy czas bezczynno¶ci.

source: ping: host not found.
pl: ping: nie znaleziono hosta.

source: Pinging %s (%s) - %d packets, delay %d sec(s), timeout %d sec(s).
pl: Pingujê %s (%s) - %d pakietów, opó¼nienie %d sek., bezczynno¶æ %d sek.

source: Pinging %s (%s) - delay %d sec(s), timeout %d sec(s).
pl: Pingujê %s (%s) - opó¼nienie %d sek., bezczynno¶æ %d sek.

source: No ping reply from %s within %d second(s)...
pl: Brak odpowiedzi ping od %s przez %d sekund...

source: Ping reply from %s: seq=%d, time=%.1f ms%s
pl: Odpowied¼ ping od %s: seq=%d, czas=%.1f ms%s

source: (skew!)
pl: (kurna!)

source: Ping reply from %s: seq=%d, time<0.1 ms (%d usecs)%s
pl: Odpowied¼ ping od %s: seq=%d, czas<0.1 ms (%d mikrosekund)%s

source: spawn: timeout!
pl: spawn: koniec czasu!

source: spawn: looking for children...
pl: spawn: szukam dzieciaków...

source: spawn: exiting...
pl: spawn: wychodzê...

source: spawn: got CHLD signal from [%d]
pl: spawn: mam sygna³ CHLD od [%d]

source: spawn: got positive lookup for this PID
pl: spawn: mam pozytywne potwierdzenie dla tego PID

source: spawn: not enough free entries in PID-table
pl: spawn: zbyt ma³o wolnych miejsc w tabeli PID

source: spawn: calling command: %s (%d/INFINITY)
pl: spawn: wo³am komendê: %s (%d/NIESKOÑCZONO¦Æ)

source: spawn: calling command: %s (%d/%d)
pl: spawn: wo³am komendê: %s (%d/%d)

source: spawn: [%d] forking...
pl: spawn [%d] rozwidlam siê...

source: spawn: [%d] rebirthing!
pl: spawn: [%d] odradzam siê!

source: spawn: CPR mode enabled exit code cannot be resolved due to alternate scanning method
pl: spawn: w³±czony tryb reanimacji kod wyj¶cia nie mo¿e byæ uzyskany, gdy¿ u¿yto alternatywnej metody skanowania

source: spawn: something is wrong.. null pointer at code_name argument!
pl: spawn: co¶ jest nie tak.. zerowy wska¼nik przy argumencie code_name!

source: spawn: invaild return code (digit expected).
pl: spawn: b³êdna warto¶æ kodu powrotu (oczekiwana liczba).

source: spawn: invaild return code value (try 0 to 255).
pl: spawn: b³êdna warto¶æ kodu powrotu (spróbuj 0 to 255).

source: spawn: something is wrong.. null pointer at time_valuee argument!
pl: spawn: co¶ jest nie tak.. zerowy wska¼nik w argumencie time_value!

source: spawn: invaild time value - only digits are supported.
pl: spawn: niew³a¶ciwa warto¶æ czasu - podawaj tylko liczby.

source: spawn: invaild time value - (try 0 to 65536)
pl: spawn: niew³a¶ciwa warto¶æ czasu - (spróbuj 0 do 65536)

source: spawn: something is wrong.. null pointer at retries_valuee argument!
pl: spawn: co¶ jest nie tak.. zerowy wska¼nik w argumencie retries_value!

source: spawn: invaild retries value - only digits are supported.
pl: spawn: niew³a¶ciwa warto¶æ czasu - podawaj tylko liczby.

source: spawn: invaild retries value - (try 0 to 32000)
pl: spawn: niew³a¶ciwa warto¶æ czasu - (spróbuj 0 do 32000)
